; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v2 ?v11)
             (pred_5 ?v7 ?v12)
             (pred_3 ?v2 ?v12)
             (pred_1 ?v10 ?v2 )
	     (pred_7 ?v2)
             (pred_6 ?v4)
             (pred_8 ?v7)
             (pred_4 ?v12)
             (pred_11 ?v2)
             (pred_9 ?v7)
             (pred_10 ?v2)
             (pred_2 ))



(:action op_2
:parameters (?v3 ?v6 ?v1 ?v9)
:precondition (and (pred_6 ?v3) (pred_6 ?v6) (pred_8 ?v1) (pred_4 ?v9)
          (pred_12 ?v3 ?v6) (pred_5 ?v1 ?v9)
                   (pred_3 ?v6 ?v9) (pred_7 ?v3) 
                   (pred_11 ?v6) (pred_9 ?v1))
:effect (and  (pred_10 ?v6) (not (pred_11 ?v6))))


(:action op_5
:parameters (?v3 ?v8)
:precondition (and (pred_6 ?v3) (pred_6 ?v8)
               (pred_7 ?v3) (pred_12 ?v3 ?v8) (pred_10 ?v8))
:effect (and (pred_7 ?v8) (not (pred_7 ?v3))))

(:action op_1
:parameters (?v3 ?v1)
:precondition (and (pred_6 ?v3) (pred_8 ?v1) 
                  (pred_7 ?v3) (pred_1 ?v1 ?v3) (pred_2 ))
:effect (and (pred_9 ?v1)
   (not (pred_1 ?v1 ?v3)) (not (pred_2 ))))


(:action op_4
:parameters (?v3 ?v5 ?v13)
:precondition (and (pred_6 ?v3) (pred_8 ?v5) (pred_8 ?v13)
                  (pred_7 ?v3) (pred_9 ?v13) (pred_1 ?v5 ?v3))
:effect (and (pred_9 ?v5) (pred_1 ?v13 ?v3)
        (not (pred_9 ?v13)) (not (pred_1 ?v5 ?v3))))

(:action op_3
:parameters (?v3 ?v1)
:precondition (and (pred_6 ?v3) (pred_8 ?v1) 
                  (pred_7 ?v3) (pred_9 ?v1))
:effect (and (pred_2 ) (pred_1 ?v1 ?v3) (not (pred_9 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_20 obj_31 obj_07 obj_26 obj_18 obj_03 obj_14 obj_08 obj_15 obj_28 obj_21 obj_25 obj_09 obj_32 obj_30 obj_10 obj_05 obj_16 obj_11 obj_13 obj_06 obj_24 obj_04 obj_12 obj_02
    obj_19 obj_17 obj_29
    obj_23 obj_27 obj_01 obj_22
    )

    (:init
       (pred_2)

       (pred_6 obj_20)
       (pred_6 obj_31)
       (pred_6 obj_07)
       (pred_6 obj_26)
       (pred_6 obj_18)
       (pred_6 obj_03)
       (pred_6 obj_14)
       (pred_6 obj_08)
       (pred_6 obj_15)
       (pred_6 obj_28)
       (pred_6 obj_21)
       (pred_6 obj_25)
       (pred_6 obj_09)
       (pred_6 obj_32)
       (pred_6 obj_30)
       (pred_6 obj_10)
       (pred_6 obj_05)
       (pred_6 obj_16)
       (pred_6 obj_11)
       (pred_6 obj_13)
       (pred_6 obj_06)
       (pred_6 obj_24)
       (pred_6 obj_04)
       (pred_6 obj_12)
       (pred_6 obj_02)
       (pred_4 obj_19)
       (pred_4 obj_17)
       (pred_4 obj_29)
       (pred_8 obj_23)
       (pred_8 obj_27)
       (pred_8 obj_01)
       (pred_8 obj_22)

       (pred_12 obj_20 obj_03)
       (pred_12 obj_20 obj_31)
       (pred_12 obj_31 obj_14)
       (pred_12 obj_31 obj_07)
       (pred_12 obj_31 obj_20)
       (pred_12 obj_07 obj_08)
       (pred_12 obj_07 obj_26)
       (pred_12 obj_07 obj_31)
       (pred_12 obj_26 obj_15)
       (pred_12 obj_26 obj_18)
       (pred_12 obj_26 obj_07)
       (pred_12 obj_18 obj_28)
       (pred_12 obj_18 obj_26)
       (pred_12 obj_03 obj_21)
       (pred_12 obj_03 obj_14)
       (pred_12 obj_03 obj_20)
       (pred_12 obj_14 obj_25)
       (pred_12 obj_14 obj_08)
       (pred_12 obj_14 obj_31)
       (pred_12 obj_14 obj_03)
       (pred_12 obj_08 obj_09)
       (pred_12 obj_08 obj_15)
       (pred_12 obj_08 obj_07)
       (pred_12 obj_08 obj_14)
       (pred_12 obj_15 obj_32)
       (pred_12 obj_15 obj_28)
       (pred_12 obj_15 obj_26)
       (pred_12 obj_15 obj_08)
       (pred_12 obj_28 obj_30)
       (pred_12 obj_28 obj_18)
       (pred_12 obj_28 obj_15)
       (pred_12 obj_21 obj_10)
       (pred_12 obj_21 obj_25)
       (pred_12 obj_21 obj_03)
       (pred_12 obj_25 obj_05)
       (pred_12 obj_25 obj_09)
       (pred_12 obj_25 obj_14)
       (pred_12 obj_25 obj_21)
       (pred_12 obj_09 obj_16)
       (pred_12 obj_09 obj_32)
       (pred_12 obj_09 obj_08)
       (pred_12 obj_09 obj_25)
       (pred_12 obj_32 obj_11)
       (pred_12 obj_32 obj_30)
       (pred_12 obj_32 obj_15)
       (pred_12 obj_32 obj_09)
       (pred_12 obj_30 obj_13)
       (pred_12 obj_30 obj_28)
       (pred_12 obj_30 obj_32)
       (pred_12 obj_10 obj_06)
       (pred_12 obj_10 obj_05)
       (pred_12 obj_10 obj_21)
       (pred_12 obj_05 obj_24)
       (pred_12 obj_05 obj_16)
       (pred_12 obj_05 obj_25)
       (pred_12 obj_05 obj_10)
       (pred_12 obj_16 obj_04)
       (pred_12 obj_16 obj_11)
       (pred_12 obj_16 obj_09)
       (pred_12 obj_16 obj_05)
       (pred_12 obj_11 obj_12)
       (pred_12 obj_11 obj_13)
       (pred_12 obj_11 obj_32)
       (pred_12 obj_11 obj_16)
       (pred_12 obj_13 obj_02)
       (pred_12 obj_13 obj_30)
       (pred_12 obj_13 obj_11)
       (pred_12 obj_06 obj_24)
       (pred_12 obj_06 obj_10)
       (pred_12 obj_24 obj_04)
       (pred_12 obj_24 obj_05)
       (pred_12 obj_24 obj_06)
       (pred_12 obj_04 obj_12)
       (pred_12 obj_04 obj_16)
       (pred_12 obj_04 obj_24)
       (pred_12 obj_12 obj_02)
       (pred_12 obj_12 obj_11)
       (pred_12 obj_12 obj_04)
       (pred_12 obj_02 obj_13)
       (pred_12 obj_02 obj_12)
       (pred_11 obj_05)
       (pred_11 obj_14)
       (pred_11 obj_24)
       (pred_11 obj_04)
       (pred_3  obj_05 obj_19)
       (pred_3  obj_14 obj_17)
       (pred_3  obj_24 obj_29)
       (pred_3  obj_04 obj_29)
       (pred_10 obj_20)
       (pred_10 obj_31)
       (pred_10 obj_07)
       (pred_10 obj_26)
       (pred_10 obj_18)
       (pred_10 obj_03)
       (pred_10 obj_08)
       (pred_10 obj_15)
       (pred_10 obj_28)
       (pred_10 obj_21)
       (pred_10 obj_25)
       (pred_10 obj_09)
       (pred_10 obj_32)
       (pred_10 obj_30)
       (pred_10 obj_10)
       (pred_10 obj_16)
       (pred_10 obj_11)
       (pred_10 obj_13)
       (pred_10 obj_06)
       (pred_10 obj_12)
       (pred_10 obj_02)

       (pred_5  obj_23 obj_19)
       (pred_5  obj_27 obj_17)
       (pred_5  obj_01 obj_29)
       (pred_5  obj_22 obj_17)
       (pred_1 obj_23 obj_30)
       (pred_1 obj_27 obj_08)
       (pred_1 obj_01 obj_11)
       (pred_1 obj_22 obj_12)
       (pred_7 obj_11)
    )

    (:goal (and
       (pred_1 obj_23 obj_26)
       (pred_1 obj_27 obj_07)
    ))
(:constraints
  (always (not (pred_7 obj_32)))
)
)

; plan
1. (op_5 obj_11 obj_16)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_16)
   goals met: 0 of 2
2. (op_5 obj_16 obj_09)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_09)
   goals met: 0 of 2
3. (op_5 obj_09 obj_08)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_08)
   goals met: 0 of 2
4. (op_1 obj_08 obj_27)
   deleted: (pred_1 obj_27 obj_08) (pred_2)
   added: (pred_9 obj_27)
   goals met: 0 of 2
5. (op_5 obj_08 obj_07)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_07)
   goals met: 0 of 2
6. (op_3 obj_07 obj_27)
   deleted: (pred_9 obj_27)
   added: (pred_2) (pred_1 obj_27 obj_07)
   goals met: 1 of 2
7. (op_5 obj_07 obj_26)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_26)
   goals met: 1 of 2
8. (op_5 obj_26 obj_18)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_18)
   goals met: 1 of 2
9. (op_5 obj_18 obj_28)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_28)
   goals met: 1 of 2
10. (op_5 obj_28 obj_30)
   deleted: (pred_7 obj_28)
   added: (pred_7 obj_30)
   goals met: 1 of 2
11. (op_1 obj_30 obj_23)
   deleted: (pred_1 obj_23 obj_30) (pred_2)
   added: (pred_9 obj_23)
   goals met: 1 of 2
12. (op_5 obj_30 obj_28)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_28)
   goals met: 1 of 2
13. (op_5 obj_28 obj_18)
   deleted: (pred_7 obj_28)
   added: (pred_7 obj_18)
   goals met: 1 of 2
14. (op_5 obj_18 obj_26)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_26)
   goals met: 1 of 2
15. (op_3 obj_26 obj_23)
   deleted: (pred_9 obj_23)
   added: (pred_2) (pred_1 obj_23 obj_26)
   goals met: 2 of 2
